#include "header.h"

FILE *file_log;

const char *ch_piece[16] =
{ "--", "歩", "--", "--", "銀", "金", "角", "飛",
  "王", "と", "--", "--", "全", "--", "馬", "竜" };

const char *ch_piece2[32] =
{ " --", "^歩", " --", " --", "^銀", "^金", "^角", "^飛",
  "^王", "^と", " --", " --", "^全", " --", "^馬", "^竜",
  " --", "v歩", " --", " --", "v銀", "v金", "v角", "v飛",
  "v王", "vと", " --", " --", "v全", " --", "v馬", "v竜" };

const char *ch_piece_csa[16] =
{ "--", "FU", "--", "--", "GI", "KI", "KA", "HI",
  "OU", "TO", "--", "--", "NG", "--", "UM", "RY" };

